arg-min-h/Community_nRF52_Arduino/boards.txt
# Debug Menu
bluemacro_nrf52840.menu.debug.l0=Level 0 (Release)
bluemacro_nrf52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
bluemacro_nrf52840.menu.debug.l1=Level 1 (Error Message)
bluemacro_nrf52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
bluemacro_nrf52840.menu.debug.l2=Level 2 (Full Debug)
bluemacro_nrf52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
bluemacro_nrf52840.menu.debug.l3=Level 3 (Segger SystemView)
bluemacro_nrf52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
bluemacro_nrf52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# -------------------------------------------------------
# 
# EBYTE TEST BOARDS
#
# -------------------------------------------------------

# ----------------------------------
# EByte E104 BT5032A Module and
#       Test Board (nRF52832)
# ----------------------------------

ebyte_e104_bt5032a.name=EByte E104 BT5032A Module and Test Board (nRF52832)
ebyte_e104_bt5032a.bootloader.tool=bootburn

# Upload
ebyte_e104_bt5032a.upload.tool=nrfutil
ebyte_e104_bt5032a.upload.protocol=nrfutil
ebyte_e104_bt5032a.upload.use_1200bps_touch=false
ebyte_e104_bt5032a.upload.wait_for_upload_port=false
ebyte_e104_bt5032a.upload.native_usb=false
ebyte_e104_bt5032a.upload.maximum_size=290816
ebyte_e104_bt5032a.upload.maximum_data_size=52224

# Build
ebyte_e104_bt5032a.build.mcu=cortex-m4
ebyte_e104_bt5032a.build.f_cpu=64000000
ebyte_e104_bt5032a.build.board=EBYTE_E104_BT5032A
ebyte_e104_bt5032a.build.core=nRF5
ebyte_e104_bt5032a.build.variant=ebyte_e104_bt5032a
ebyte_e104_bt5032a.build.usb_manufacturer="EByte"
ebyte_e104_bt5032a.build.usb_product="EByte E104 nRF52832"
ebyte_e104_bt5032a.build.extra_flags=-DNRF52832_XXAA -DNRF52
ebyte_e104_bt5032a.build.ldscript=nrf52832_s132_v6.ld

# SofDevice Menu
ebyte_e104_bt5032a.menu.softdevice.s132v6=0.4.1 SoftDevice s132 6.1.1
ebyte_e104_bt5032a.menu.softdevice.s132v6.build.sd_name=s132
ebyte_e104_bt5032a.menu.softdevice.s132v6.build.bl_version=21.5.29
ebyte_e104_bt5032a.menu.softdevice.s132v6.build.sd_version=6.1.1
ebyte_e104_bt5032a.menu.softdevice.s132v6.build.sd_fwid=0x00B7


# Debug Menu
ebyte_e104_bt5032a.menu.debug.l0=Level 0 (Release)
ebyte_e104_bt5032a.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
ebyte_e104_bt5032a.menu.debug.l1=Level 1 (Error Message)
ebyte_e104_bt5032a.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
ebyte_e104_bt5032a.menu.debug.l2=Level 2 (Full Debug)
ebyte_e104_bt5032a.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
ebyte_e104_bt5032a.menu.debug.l3=Level 3 (Segger SystemView)
ebyte_e104_bt5032a.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
ebyte_e104_bt5032a.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# EByte E73 TBB Test Board (nRF52832)    
# ----------------------------------

ebyte_e73_tbb.name=EByte E73 TBB Test Board (nRF52832)
ebyte_e73_tbb.bootloader.tool=bootburn

# Upload
ebyte_e73_tbb.upload.tool=nrfutil
ebyte_e73_tbb.upload.protocol=nrfutil
ebyte_e73_tbb.upload.use_1200bps_touch=false
ebyte_e73_tbb.upload.wait_for_upload_port=false
ebyte_e73_tbb.upload.native_usb=false
ebyte_e73_tbb.upload.maximum_size=290816
ebyte_e73_tbb.upload.maximum_data_size=52224

# Build
ebyte_e73_tbb.build.mcu=cortex-m4
ebyte_e73_tbb.build.f_cpu=64000000
ebyte_e73_tbb.build.board=EBYTE_E73_TBB
ebyte_e73_tbb.build.core=nRF5
ebyte_e73_tbb.build.variant=ebyte_e73_tbb
ebyte_e73_tbb.build.usb_manufacturer="EByte"
ebyte_e73_tbb.build.usb_product="EByte E73 TBB nRF52832"
ebyte_e73_tbb.build.extra_flags=-DNRF52832_XXAA -DNRF52
ebyte_e73_tbb.build.ldscript=nrf52832_s132_v6.ld

# SofDevice Menu
ebyte_e73_tbb.menu.softdevice.s132v6=0.4.1 SoftDevice s132 6.1.1
ebyte_e73_tbb.menu.softdevice.s132v6.build.sd_name=s132
ebyte_e73_tbb.menu.softdevice.s132v6.build.bl_version=21.5.30.1
ebyte_e73_tbb.menu.softdevice.s132v6.build.sd_version=6.1.1
ebyte_e73_tbb.menu.softdevice.s132v6.build.sd_fwid=0x00B7


# Debug Menu
ebyte_e73_tbb.menu.debug.l0=Level 0 (Release)
ebyte_e73_tbb.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
ebyte_e73_tbb.menu.debug.l1=Level 1 (Error Message)
ebyte_e73_tbb.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
ebyte_e73_tbb.menu.debug.l2=Level 2 (Full Debug)
ebyte_e73_tbb.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
ebyte_e73_tbb.menu.debug.l3=Level 3 (Segger SystemView)
ebyte_e73_tbb.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
ebyte_e73_tbb.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1


# -------------------------------------------------------
# 
# JORIC BOARDS
#
# -------------------------------------------------------



# -------------------------------------------------------
# 
# NICE KEYBOARDS BOARDS
#
# -------------------------------------------------------

# ----------------------------------
# Nice Nano - 
# see https://docs.nicekeyboards.com/#/nice!nano/pinout_schematic
# ----------------------------------

nice_nano.name=Nice Keyboard's nice!nano
nice_nano.bootloader.tool=bootburn

# Upload
nice_nano.upload.tool=nrfutil
nice_nano.upload.protocol=nrfutil
nice_nano.upload.use_1200bps_touch=true
nice_nano.upload.wait_for_upload_port=true
nice_nano.upload.maximum_size=815104
nice_nano.upload.maximum_data_size=237568

# Build
nice_nano.build.mcu=cortex-m4
nice_nano.build.f_cpu=64000000
nice_nano.build.board=NICE_NANO
nice_nano.build.core=nRF5
nice_nano.build.variant=nice_nano
nice_nano.build.usb_manufacturer="Nice Keyboards"
nice_nano.build.usb_product="nice!nano"
nice_nano.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
nice_nano.build.ldscript=nrf52840_s140_v6.ld
nice_nano.build.vid=0x239A
nice_nano.build.pid=0x00B3

# SofDevice Menu
nice_nano.menu.softdevice.s140v6=0.4.1 SoftDevice s140 6.1.1
nice_nano.menu.softdevice.s140v6.build.sd_name=s140
nice_nano.menu.softdevice.s140v6.build.bl_version=0.4.1
nice_nano.menu.softdevice.s140v6.build.sd_version=6.1.1
nice_nano.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
nice_nano.menu.debug.l0=Level 0 (Release)
nice_nano.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
nice_nano.menu.debug.l1=Level 1 (Error Message)
nice_nano.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
nice_nano.menu.debug.l2=Level 2 (Full Debug)
nice_nano.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
nice_nano.menu.debug.l3=Level 3 (Segger SystemView)
nice_nano.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
nice_nano.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1


# -------------------------------------------------------
# 
# NORDIC SEMICONDUCTORS BOARDS
#
# -------------------------------------------------------

# ----------------------------------
# Nordic nRF52832DK (PCA10040)
# ----------------------------------

# ----------------------------------
# Nordic nRF52840DK (PCA10056)
# ----------------------------------
pca10056.name=Nordic nRF52840DK (PCA10056)
pca10056.bootloader.tool=bootburn

# Upload
pca10056.upload.tool=nrfutil
pca10056.upload.protocol=nrfutil
pca10056.upload.use_1200bps_touch=true
pca10056.upload.wait_for_upload_port=true
pca10056.upload.maximum_size=815104
pca10056.upload.maximum_data_size=237568

# Build
pca10056.build.mcu=cortex-m4
pca10056.build.f_cpu=64000000
pca10056.build.board=NRF52840_PCA10056
pca10056.build.core=nRF5
pca10056.build.variant=pca10056
pca10056.build.usb_manufacturer="Nordic"
pca10056.build.usb_product="nRF52840 DK"
pca10056.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
pca10056.build.ldscript=nrf52840_s140_v6.ld
pca10056.build.vid=0x239A
pca10056.build.pid=0x8029

# SofDevice Menu
pca10056.menu.softdevice.s140v6=0.4.1 SoftDevice s140 6.1.1
pca10056.menu.softdevice.s140v6.build.sd_name=s140
pca10056.menu.softdevice.s140v6.build.bl_version=0.4.1
pca10056.menu.softdevice.s140v6.build.sd_version=6.1.1
pca10056.menu.softdevice.s140v6.build.sd_fwid=0x00B6

